# Data frame -table
# series-row or column

In [25]:
import numpy as np
import pandas as pd

In [35]:
a = ['ujwal', 'sahil', 'akarsh']

In [36]:
pd.DataFrame(a)

        0
0   ujwal
1   sahil
2  akarsh

In [37]:
b = ['sahil', 'ujwal', 'harry']

In [53]:
b = pd.DataFrame(b, index =['A', 'B', 'C'], columns= ['Students'])

In [54]:
b

  Students
A    sahil
B    ujwal
C    harry

In [58]:
b['Students']

A    sahil
B    ujwal
C    harry
Name: Students, dtype: object

In [59]:
type(b)

pandas.core.frame.DataFrame

In [60]:
type(b['Students'])

pandas.core.series.Series

### multiple series

In [61]:
names = ['ujwal', 'abhi', 'sahil']
marks = [30, 20, 13]

In [69]:
pd.DataFrame(names, marks, columns = ['names'])

    names
30  ujwal
20   abhi
13  sahil

In [70]:
# DataFrame(data=None, index: 'Axes | None' = None, columns: 'Axes | None' = None, dtype: 'Dtype | None' = None, copy: 'bool | None' = None) -> 'None'

In [95]:
row1 = ['ujwal', 20, 'driver', 99.99]
row2 = ['sahil', 22, 'rider', 50]
row3 = ['happy', 20, 'writer', 60]

In [96]:
a = [row1, row2, row3]

In [97]:
a

[['ujwal', 20, 'driver', 99.99],
 ['sahil', 22, 'rider', 50],
 ['happy', 20, 'writer', 60]]

In [98]:
b = np.array([row1, row2, row3],)

In [99]:
b

array([['ujwal', '20', 'driver', '99.99'],
       ['sahil', '22', 'rider', '50'],
       ['happy', '20', 'writer', '60']], dtype='<U32')

In [100]:
pd.DataFrame(a)

       0   1       2      3
0  ujwal  20  driver  99.99
1  sahil  22   rider  50.00
2  happy  20  writer  60.00

In [101]:
pd.DataFrame(b)

       0   1       2      3
0  ujwal  20  driver  99.99
1  sahil  22   rider     50
2  happy  20  writer     60

In [106]:
indexes = "A B C".split()

In [107]:
columns = "name age work weight".split()

In [108]:
df = pd.DataFrame(a, index= indexes, columns= columns)

In [109]:
df

    name  age    work  weight
A  ujwal   20  driver   99.99
B  sahil   22   rider   50.00
C  happy   20  writer   60.00

## putting data through dictionary

In [110]:
d = {
    1: ["shubham" , 20, 'netmax', 63.6, "np"],
    2: ["abhi" , 40, 'dev', 65.8, None],
    3: ["akash" , 50, 'data', 73.1, None]
    
}

In [111]:
d

{1: ['shubham', 20, 'netmax', 63.6, 'np'],
 2: ['abhi', 40, 'dev', 65.8, None],
 3: ['akash', 50, 'data', 73.1, None]}

In [112]:
pd.DataFrame(d)

         1     2      3
0  shubham  abhi  akash
1       20    40     50
2   netmax   dev   data
3     63.6  65.8   73.1
4       np  None   None

In [113]:
d = {
    "name": ["shubham" , "abhi", "akash"],
    "age": [20, 25, 30],
    "weight": [63.3, 52.0, 41.7]
    
}

In [114]:
d

{'name': ['shubham', 'abhi', 'akash'],
 'age': [20, 25, 30],
 'weight': [63.3, 52.0, 41.7]}

In [115]:
df = pd.DataFrame(d, index=range(100, 103))

In [116]:
df

        name  age  weight
100  shubham   20    63.3
101     abhi   25    52.0
102    akash   30    41.7